In [2]:
import pandas as pd
import numpy as np
import scipy.stats as ss
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
 df = pd.DataFrame({"A": ["a0", "a1", "a1", "a2", "a3", "a4"], "B": ["b0", "b1", "b2", "b2", "b3", None],
                       "C": [1, 2, None, 3, 4, 5], "D": [0.1, 10.2, 11.4, 8.9, 9.1, 12], "E": [10, 19, 32, 25, 8, None],
                       "F": ["f0", "f1", "g2", "f3", "f4", "f5"]})

In [4]:
df

    A     B    C     D     E   F
0  a0    b0  1.0   0.1  10.0  f0
1  a1    b1  2.0  10.2  19.0  f1
2  a1    b2  NaN  11.4  32.0  g2
3  a2    b2  3.0   8.9  25.0  f3
4  a3    b3  4.0   9.1   8.0  f4
5  a4  None  5.0  12.0   NaN  f5

### 处理异常值

In [5]:
 df.isnull()

       A      B      C      D      E      F
0  False  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False   True  False  False  False
3  False  False  False  False  False  False
4  False  False  False  False  False  False
5  False   True  False  False   True  False

In [7]:
df.dropna(subset=["B","C"])

    A   B    C     D     E   F
0  a0  b0  1.0   0.1  10.0  f0
1  a1  b1  2.0  10.2  19.0  f1
2  a1  b2  NaN  11.4  32.0  g2
3  a2  b2  3.0   8.9  25.0  f3
4  a3  b3  4.0   9.1   8.0  f4

### 处理重复值

In [8]:
df.duplicated(["A"],keep="first")

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [11]:
# keep = false,first,last
df.duplicated(["A","B"],keep="first")

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [12]:
df.drop_duplicates(["A","B"],keep="first",inplace=False)

    A     B    C     D     E   F
0  a0    b0  1.0   0.1  10.0  f0
1  a1    b1  2.0  10.2  19.0  f1
2  a1    b2  NaN  11.4  32.0  g2
3  a2    b2  3.0   8.9  25.0  f3
4  a3    b3  4.0   9.1   8.0  f4
5  a4  None  5.0  12.0   NaN  f5

### 替换异常值

In [13]:
 df["B"].fillna("b*")

0    b0
1    b1
2    b2
3    b2
4    b3
5    b*
Name: B, dtype: object

In [14]:
df["E"].fillna(df["E"].mean())

0    10.0
1    19.0
2    32.0
3    25.0
4     8.0
5    18.8
Name: E, dtype: float64

#### 样条差值

In [16]:
pd.Series([1, None, 4, 10, 8]).interpolate()

0     1.0
1     2.5
2     4.0
3    10.0
4     8.0
dtype: float64

In [15]:
## 样条差值
df["E"].interpolate(method="spline",order=3)

0    10.000000
1    19.000000
2    32.000000
3    25.000000
4     8.000000
5   -20.143603
Name: E, dtype: float64

### 四分位数上下界

In [17]:
df[df['D'] < df["D"].quantile(0.75) + 1.5 * (df["D"].quantile(0.75) - df["D"].quantile(0.25))][df["D"] > df["D"].quantile(0.25) - 1.5 * (df["D"].quantile(0.75) - df["D"].quantile(0.25))]

    A     B    C     D     E   F
1  a1    b1  2.0  10.2  19.0  f1
2  a1    b2  NaN  11.4  32.0  g2
3  a2    b2  3.0   8.9  25.0  f3
4  a3    b3  4.0   9.1   8.0  f4
5  a4  None  5.0  12.0   NaN  f5

In [18]:
df[[True if item.startswith("f") else False for item in list(df["F"].values)]]

    A     B    C     D     E   F
0  a0    b0  1.0   0.1  10.0  f0
1  a1    b1  2.0  10.2  19.0  f1
3  a2    b2  3.0   8.9  25.0  f3
4  a3    b3  4.0   9.1   8.0  f4
5  a4  None  5.0  12.0   NaN  f5